export const years = [];
export const months = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12];
export const days31 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31];
export const days30 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30];
export const days29 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29];
export const days28 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28];
// 生年月日入力フォームの初期値
export const year = '1980 年 (昭和55)';
export const month = 1;
export const day = 1;

for(let i = 1930; i <= 2021; i++){
  if(i <= 1989){
    years.push(i + ' 年 (昭和' + (i-1925) + ')');
  }else if(1989 < i && i <= 2019){
    years.push(i + ' 年 (平成' + (i-1988) + ')');
  }else{
    years.push(i + ' 年 (令和' + (i-2018) + ')');
  }
}
